log/tilde-club.org
#+TITLE: Server Log: tilde.club

The org-mode parser on github doesn't understand lists, sadly. So a lot
of this file is invisible. View raw or check out the HTML output that is
also in this directory.

* Launch <2014-10-01 Wed>
- I think this was the day it launched. I honestly can't remember.

* Crash <2014-10-04 Sat>
** Notes
- Informed of problem via Twitter.
- [Redacted] user wrote to say:

#+BEGIN_BLOCKQUOTE
I put "bash" in my .bashrc (like the command, on a line). This seems incredibly stupid in retrospect but I was trying to get my shell to load my aliases and if I ran `bash` they did, so...

Sorrrryryryhuetnaouemkb

I'm going to put myself in an infinite loop of timeout

(IF I'm allowed back on, which would be understood if I weren't)
#+END BLOCKQUOTE

** DONE Resolution
- Rebooted server
- Renamed bad .bashrc so that it would not execute when user logged in


* Backup <2014-10-04 Sat>
- Backed up =/var=, =/etc=, and =/home=.
- Saved to Paul Ford's home computer.


* Server Crash <2014-10-07 Tue>
** Notes
- System log on AWS was last updated on Saturday, 10/4--at time of last bootup.


** TODO Resolution

1) Rebooted the Server
   - This did not work and system log did not clear out or update.
   - While this was going on I received an email from Amazon letting me
     know that the server would be retired on October 21st. This appears
     to be unrelated to this current issue but definitely confused me.
   - FAILED.

2) Made a snapshot of the EBS volume attached to tilde.club
   - Launched a new instance based on that EBS
   - Kernel panic; see [[./server-logs/2014-10-07.txt]]
   - I'm not sure if this is me or the disk, though.
   - I'm getting
     - =Using IPI No-Shortcut mode=
     - =XENBUS: Timeout connecting to devices!=
     - =md: Autodetecting RAID arrays.=
     - =md: autorun ...=
     - =md: ... autorun DONE.=
     - =Kernel panic - not syncing: VFS: Unable to mount root fs on unknown-block(8,1)=

3) Tried to look at the volume
   - Made a new instance
   - Made a new volume based on the snapshot
   - Tried to mount it
   - The volume identifies as GRUB
   - It's not a single volume, then, it's a filesystem with multiple volumes
   - I'm not sure how to attach whole filesystems as EBS volumes
