log/tilde-club.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Server Log: tilde.club</title>
<!-- 2014-10-07 Tue 09:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Ford" />
</head>
<body>
<div id="content">
<h1 class="title">Server Log: tilde.club</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Launch <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-01 Wed&gt;</span></span></a></li>
<li><a href="#sec-2">2. Crash <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-04 Sat&gt;</span></span></a>
<ul>
<li><a href="#sec-2-1">2.1. Notes</a></li>
<li><a href="#sec-2-2">2.2. <span class="done DONE">DONE</span> Resolution</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Backup <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-04 Sat&gt;</span></span></a></li>
<li><a href="#sec-4">4. Server Crash <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-07 Tue&gt;</span></span></a>
<ul>
<li><a href="#sec-4-1">4.1. Notes</a></li>
<li><a href="#sec-4-2">4.2. <span class="todo TODO">TODO</span> Resolution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Launch <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-01 Wed&gt;</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>I think this was the day it launched. I honestly can't remember.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Crash <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-04 Sat&gt;</span></span></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Notes</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Informed of problem via Twitter.
</li>
<li>[Redacted] user wrote to say:
</li>
</ul>

<p>
#+BEGIN<sub>BLOCKQUOTE</sub>
I put "bash" in my .bashrc (like the command, on a line). This seems incredibly stupid in retrospect but I was trying to get my shell to load my aliases and if I ran `bash` they did, so&#x2026;
</p>

<p>
Sorrrryryryhuetnaouemkb
</p>

<p>
I'm going to put myself in an infinite loop of timeout
</p>

<p>
(IF I'm allowed back on, which would be understood if I weren't)
#+END BLOCKQUOTE
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Resolution</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Rebooted server
</li>
<li>Renamed bad .bashrc so that it would not execute when user logged in
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Backup <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-04 Sat&gt;</span></span></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Backed up <code>/var</code>, <code>/etc</code>, and <code>/home</code>.
</li>
<li>Saved to Paul Ford's home computer.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Server Crash <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-07 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Notes</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>System log on AWS was last updated on Saturday, 10/4&#x2013;at time of last bootup.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Resolution</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Rebooted the Server
<ul class="org-ul">
<li>This did not work and system log did not clear out or update.
</li>
<li>While this was going on I received an email from Amazon letting me
know that the server would be retired on October 21st. This appears
to be unrelated to this current issue but definitely confused me.
</li>
<li>FAILED.
</li>
</ul>
</li>

<li>Made a snapshot of the EBS volume attached to tilde.club
<ul class="org-ul">
<li>Launched a new instance based on that EBS
</li>
<li>Kernel panic; see <a href="./server-logs/2014-10-07.txt">./server-logs/2014-10-07.txt</a>
</li>
<li>I'm not sure if this is me or the disk, though.
</li>
<li>I'm getting
<ul class="org-ul">
<li><code>Using IPI No-Shortcut mode</code>
</li>
<li><code>XENBUS: Timeout connecting to devices!</code>
</li>
<li><code>md: Autodetecting RAID arrays.</code>
</li>
<li><code>md: autorun ...</code>
</li>
<li><code>md: ... autorun DONE.</code>
</li>
<li><code>Kernel panic - not syncing: VFS: Unable to mount root fs on unknown-block(8,1)</code>
</li>
</ul>
</li>
</ul>
</li>

<li>Tried to look at the volume
<ul class="org-ul">
<li>Made a new instance
</li>
<li>Made a new volume based on the snapshot
</li>
<li>Tried to mount it
</li>
<li>The volume identifies as GRUB
</li>
<li>It's not a single volume, then, it's a filesystem with multiple volumes
</li>
<li>I'm not sure how to attach whole filesystems as EBS volumes
</li>
</ul>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Ford</p>
<p class="date">Created: 2014-10-07 Tue 09:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.50.1 (<a href="http://orgmode.org">Org</a> mode 8.0)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
